/***********************************************************************************************************
* 版权                                                                                                     *
*                                                                                                          *
* 文件名称: systick.h                                                                                      *
* 描    述: 延时函数的声明                                                                                 *
* 作    者: 姜世奇                                                                                         *
* 当前版本: 1.0.1                                                                                          *  
* 完成时间:                                                                                                *
* ---------------------------------------------------------------------------------------------------------*
* 历史信息:                                                                                                *
*           <Date>            |    <Version>    |    <Author>    |    <Description>                        *
* ---------------------------------------------------------------------------------------------------------*
*   2019年9月26日10:49:03     |      1.0.1      |     姜世奇     |     Create file                         *            
*----------------------------------------------------------------------------------------------------------*
***********************************************************************************************************/ 
#include "include.h"
#include "systick.h"  



void SysTick_Init(void)
{
	SysTick->CTRL &= 0xfffffffb;	//使用外部时钟源8分频   9Mhz
//	SysTick->CTRL |= 0x00000002;	//产生中断服务
	SysTick->CTRL &= 0xfffffffd;		//关闭中断服务
	
	SysTick->LOAD  =(uint32_t)100*9000;	//重装载1ms

	SysTick->VAL   = 0;           //写值使其寄存器清零

	SysTick->CTRL |= 0x00000001;  //开启SysTick定时器
}	


	
	
//	while(1)
//	{
//		i=1-i;
//			
//		LED(~i);
//			
//		SysTick->CTRL|=0x00000001;	//开启嘀嗒定时器
//		SysTick->VAL=0;		//清零计数器
//		do{
//			temp=SysTick->CTRL;	//查询标志位
//		}while((temp & (1<<16))==0);	//判断是否结束
//		SysTick->CTRL&=0xfffffffe;	//关闭定时器
//	}




